Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.52/atdf/ATSAMR21E18A.atdf
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMR21E" caption="SAMR21E">
      <pin position="1" pad="XTAL2"/>
      <pin position="2" pad="XTAL1"/>
      <pin position="3" pad="GNDANA"/>
      <pin position="4" pad="VDDANA"/>
      <pin position="5" pad="AVDD1A"/>
      <pin position="6" pad="AVSS1A"/>
      <pin position="7" pad="PA06"/>
      <pin position="8" pad="PA07"/>
      <pin position="9" pad="PA08"/>
      <pin position="10" pad="PA09"/>
      <pin position="11" pad="AVSS_RFP"/>
      <pin position="12" pad="RFP"/>
      <pin position="13" pad="RFN"/>
      <pin position="14" pad="AVSS_RFN"/>
      <pin position="15" pad="PA14"/>
      <pin position="16" pad="PA15"/>
      <pin position="17" pad="PA16"/>
      <pin position="18" pad="PA17"/>
      <pin position="19" pad="PA18"/>
      <pin position="20" pad="PA19"/>
      <pin position="21" pad="DVDD1A"/>
      <pin position="22" pad="PA24"/>
      <pin position="23" pad="PA25"/>
      <pin position="24" pad="VDDIO"/>
      <pin position="25" pad="PA27"/>
      <pin position="26" pad="RESET_N"/>
      <pin position="27" pad="PA28"/>
      <pin position="28" pad="GND"/>
      <pin position="29" pad="VDDCORE"/>
      <pin position="30" pad="VDDIN"/>
      <pin position="31" pad="PA30"/>
      <pin position="32" pad="PA31"/>
      <pin position="CLKM" pad="PC16" type="INTERNAL_33"/>
      <pin position="DB" pad="DVSS1A" type="INTERNAL_34"/>
      <pin position="DIG1" pad="PB16" type="INTERNAL_35"/>
      <pin position="DIG2" pad="PB17" type="INTERNAL_36"/>
      <pin position="DIG3" pad="PA10" type="INTERNAL_37"/>
      <pin position="DIG4" pad="PA11" type="INTERNAL_38"/>
      <pin position="DVSS4A" pad="GNDIO" type="INTERNAL_39"/>
      <pin position="DVSS4B" pad="GNDIO" type="INTERNAL_40"/>
      <pin position="IRQ" pad="PB00" type="INTERNAL_41"/>
      <pin position="MISO" pad="PC19" type="INTERNAL_42"/>
      <pin position="MOSI" pad="PB30" type="INTERNAL_43"/>
      <pin position="RSTN" pad="PB15" type="INTERNAL_44"/>
      <pin position="SCLK" pad="PC18" type="INTERNAL_45"/>
      <pin position="SEL" pad="PB31" type="INTERNAL_46"/>
      <pin position="SLP_TR" pad="PA20" type="INTERNAL_47"/>
      <pin position="TST" pad="PB14" type="INTERNAL_48"/>
      <pin position="TSTON" pad="PB08" type="INTERNAL_49"/>
      <pin position="TSTOP" pad="PB09" type="INTERNAL_50"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
